Repository: xsoulspace/word_by_word_game
Catalog: packages/wbw_locale/lib/src/l10n/intl_*.arb
Languages: it, ru

source: Finish game
it: Gioco finito
ru: Завершить игру

source: Reset ending
it: Reimposta fine
ru: Сбросить слово

source: Play
it: Giocare a
ru: Играть

source: Confirm
it: Confermare
ru: Применить

# applyAndEndTurn
source: Apply & End Turn
it: Fine turno
ru: Завершить ход

source: To Landscapes
it: Ai paesaggi
ru: В Места

source: Hide pane
it: Nascondi riquadro
ru: Скрыть панель

source: Show pane
it: Mostra riquadro
ru: Показать панель

source: Send
it: Inviare
ru: Отправить

# unblockCharacterForPoints
source: Unblock character {character} for {points} points?
it: Sbloccare la lettera {character} per {points} punti?
ru: Разблокировать букву {character} за {points} очков?

# youDontHaveEnoughPointsToUnlockCharacter
source: You don't have enough points ({points}) to unlock this character.
it: Non hai abbastanza ({points}) per sbloccare questa lettera.
ru: У вас недостаточно очков ({points}) для разблокировки буквы.

source: Graphics credits & thanks:
it: Crediti grafici e ringraziamenti:
ru: Графика и спасибо:

source: Suggestions
it: Suggerimenti
ru: Подсказки

source: Hide keyboard
it: Nascondi tastiera
ru: Скрыть клавиатуру

source: Show keyboard
it: Mostra tastiera
ru: Показать клавиатуру

# youHaveLandedInTheNowhere
source: You have landed in the middle of nowhere..
it: Sei atterrato in mezzo al nulla..
ru: Вы приземлились где-то в неизвестность..

source: Profile Creator
it: Creatore di profili
ru: Создатель профиля

# currentPlayerName
source: Name of current player
it: Nome del giocatore attuale
ru: Ник текущего игрока

source: Return To Landscapes
it: Ritorna ai paesaggi
ru: Вернуться к местам

# selectPlayers
source: Select the Players
it: Seleziona i giocatori
ru: Выбери игроков

source: Choose Your Character
it: Scegli il tuo personaggio
ru: Выбери своего персонажа

# chooseLandscape
source: Choose a Landscape
it: Scegli un paesaggio
ru: Выбери место

source: Settings
it: Impostazioni
ru: Настройки

# playersAndHighscore
source: Players & Highscore
it: Giocatori e punteggio
ru: Игроки и опыт

# startNewGame
source: Quick Start
it: Avvio Rapido
ru: Быстрая игра

source: Congratulations!
it: Congratulazioni!
ru: Поздравляем!

source: Previous Word
it: Parola precedente
ru: Предыдущее слово

source: Create Profile
it: Creare Profili
ru: Создать профиль

source: Power of entered word
it: potere della parola inserita
ru: Очки введеного слова

source: Username
it: Nome utente
ru: Ник игрока

# about
source: Credits
it: Di
ru: Об игре

# wordIsNotCorrect
source: We cannot find the word {word} in our dictionary! Try another word or add it.
it: Non riusciamo a trovare la parola {word} nel nostro dizionario! Prova un'altra parola o aggiungila.
ru: Этого слова {word} нет в словаре! Попробуй другое слово или добавь в словарь.

# wordAlreadyWritten
source: This word already written. Try another word.
it: Questa parola è già scritta. Prova con un'altra parola.
ru: Это слово уже было. Попробуй другое слово.

source: Max highscore is
it: Il punteggio massimo è
ru: Лучший результат

# continueGame
source: Continue
it: Continua
ru: Продолжить

source: Start again
it: Ricomincia
ru: Заново

# yourHighscore
source: This time your score is
it: Questa volta il tuo punteggio è
ru: В этот раз, результат

source: player
it: giocatore
ru: игрок

source: Last word:
it: Ultima parola:
ru: Последнее слово:

# hintAddBeginning
source: beginning
it: inizio
ru: начало

# hintAddNewWord
source: add new word
it: aggiungi nuova parola
ru: ввести новое слово

# hintAddEnding
source: ending
it: fine
ru: окончание

# addNewWord
source: add
it: aggiungi
ru: добавить

source: New Game
it: Nuovo gioco
ru: Новая игра

# sendFeedback
source: If you have an idea, improvements, or bugs join Discord server.
it: Se hai un'idea, miglioramenti o bug unisciti al server Discord.
ru: Если у вас есть идея, улучшения или ошибки, присоединяйтесь к серверу Discord.

source: Try another word
it: Prova un'altra parola
ru: Попробовать другое слово

# notEnoughKnowledgeToRevealWord
source: Not enough points ({costOfWord}/{userPoints})
it: Punti insufficienti ({costOfWord}/{userPoints})
ru: Не хватает очков ({costOfWord}/{userPoints})

# useCostKnowledgePoints
source: Use {costOfWord} knowledge points
it: Utilizzare i punti di conoscenza: {costOfWord}
ru: Использовать очки знаний: {costOfWord}

source: Reveal suggested word?
it: Rivela la parola suggerita?
ru: Открыть слово-подсказку?

# ok
source: Nice
it: Bello
ru: Отлично

source: Suggested Word
it: Parola suggerita
ru: Слово-подсказка

# noWordsSuggestions
source: There is no words suggestions :(
it: Non ci sono suggerimenti di parole :(
ru: Слов-подсказок не осталось :(

# tryWithDifferentLetters
source: Try it with diffirent letters..
it: Provate con lettere diverse..
ru: Попробуй с другими буквами..

source: Back
it: Indietro
ru: Назад

source: Privacy Policy
it: Politica sulla riservatezza
ru: Политика конфиденциальности

# creatingGame
source: Hi, I'm Anton. Thank you for your interest in this game. Hope you like it:)
it: Ciao, sono Anton. Grazie per il tuo interesse per questo gioco. Spero ti piaccia:)
ru: Привет! Спасибо за интерес к игре и надеюсь она понравилась:)

# supportGame
source: You can support the game in https://boosty.to/arenukvern
it: Puoi supportare il gioco in https://boosty.to/arenukvern
ru: Создание игры можно дополнительно поддержать здесь https://boosty.to/arenukvern

# thankYou
source: Have a great day!
it: Grazie e buon gioco!
ru: Спасибо и хорошего времяпрепровождения!

# currentScore
source: score
it: punteggio
ru: результат

source: highscore
it: Punteggio più alto
ru: лучший результат

source: letters to remove
it: lettere da rimuovere
ru: букв для удаления

source: Players
ru: Игроки

# menuLanguage
source: Lang
it: Lingua
ru: Язык

# menuInfo
source: Info
ru: Об игре

# menuNewGame
source: New
it: Nuovo
ru: Заново

source: Select Action
it: Seleziona Azione
ru: Выбери действие

source: Cook Food
it: Cucinare
ru: Еда

# refuelStorage
source: Refuel Balloon
it: Rifornirsi
ru: Топливо

source: Add to Dictionary
it: Aggiungi al diz
ru: Внести в словарь

# suggestWordButtonTooltip
source: Click to get random word based on current letters.
it: Fare clic per ottenere una parola casuale in base alle lettere correnti.
ru: Нажми, чтобы получить случайное слово на основе текущих букв.

# mainMenuButtonTooltip
source: Click to open menu (current progress will be saved).
it: Fare clic per aprire il menu (i progressi correnti verranno salvati).
ru: Нажми, чтобы открыть меню (текущий прогресс будет сохранен).

# yourCurrentHighcoreTooltip
source: Your current points.
it: Il tuo record attuale.
ru: Текущее кол-во очков знаний.

# youDontHaveEnoughPoints
source: You don't have enough points to apply.
it: Pallone non necessario per l'approssimazione.
ru: Недостаточно очков знаний для применения.

# applyFuelOption
source: Convert score to energy
it: Convertire il punteggio in energia
ru: Обменяй очки на энергию

# createNewFirstPlayerTitle
source: Create player profile to start a game.
it: Crea un profilo giocatore per iniziare una partita.
ru: Создай профиль игрока, чтобы начать игру.

# createNewPlayerTooltip
source: Click to create profile for new player.
it: Fare clic per creare il profilo per il nuovo giocatore.
ru: Нажми, чтобы создать профиль нового игрока.

# createNewPlayerTitle
source: Create profile for new player.
it: Crea profilo per nuovo giocatore.
ru: Создай профиль нового игрока.

# createNewPlayerBody
source: You will be able to add this player's profile to any new game.
it: Potrai aggiungere il profilo di questo giocatore a qualsiasi nuova partita.
ru: Профиль этого игрока можно будет добавить в любую новую игру.

source: Create player
it: Crea giocatore
ru: Создать игрока

source: Yes
it: Si
ru: Да

source: Wind
it: Vento
ru: Ветер

source: Weather
it: Meteorologico
ru: Погода

# windCalm
source: Calm
ru: спокойствие

# windLightAir
source: Light Air
it: Aria leggera
ru: легкий воздух

# windLightBreeze
source: Light Breeze
it: Brezza leggera
ru: легкий бриз

# windGentleBreeze
source: Gentle Breeze
it: Brezza leggera
ru: нежный бриз

# windModerateBreeze
source: Moderate Breeze
it: Brezza moderata
ru: умеренный бриз

# windFreshBreeze
source: Fresh Breeze
it: Brezza fresca
ru: свежий бриз

# windStrongBreeze
source: Strong Breeze
it: Brezza forte
ru: сильный бриз

# windHighWind
source: High Wind
it: Vento forte
ru: сильный ветер

# windGale
source: Gale
it: Burrasca
ru: буря

# windSevereGale
source: Severe Gale
it: Burrasca severa
ru: суровая буря

# windStorm
source: Storm
it: Tempesta
ru: шторм

# windViolentStorm
source: Violent Storm
it: Tempesta violenta
ru: сильный шторм

# windHurricane
source: Hurricane
it: Uragano
ru: ураган

source: Power
it: Energia
ru: Энергия

source: Next weather in
it: Prossimo tempo in
ru: До смены погоды

source: No
ru: Нет

# enableTutorial
source: Use Tutorial
it: Utilizzare il tutorial
ru: Пройти обучение

source: Close
it: Chiudere
ru: Закрыть

source: Name
it: Nome
ru: Имя

source: Next player
it: Prossimo giocatore
ru: Следующий игрок
